In [7]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('../data/output/in_time_cleaned.csv')

In [6]:
df

,Ref_month,Customer_id,Birth_date,No_dependants,Time_in_address,Time_in_current_job,Credit_cards,Debit_cards,Active_accounts,Oldest_account_date,...,out_transactions_amt_H8,out_transactions_amt_H7,out_transactions_amt_H6,out_transactions_amt_H5,out_transactions_amt_H4,out_transactions_amt_H3,out_transactions_amt_H2,out_transactions_amt_H1,out_transactions_amt_H0,Target
0,11-2022,33344475,21-05-1988,0,3.41,4.13,0,2,2,26-06-2008,...,4576.57,3981.55,4607.80,4182.93,3831.11,4210.16,3832.29,4727.64,4022.14,0
1,07-2022,38290809,07-07-1983,1,2.28,11.00,0,1,1,16-05-2015,...,3472.92,3559.04,3564.92,3614.82,3602.57,3552.99,3584.06,3512.58,3624.90,0
2,01-2022,33178125,16-09-1982,1,8.99,1.73,1,2,1,11-02-2005,...,14188.19,12669.79,13334.48,12731.75,12651.15,12282.69,12287.79,12827.02,12984.93,0
3,12-2022,37129367,13-05-1985,2,5.55,1.76,0,1,1,27-01-2006,...,4286.46,3914.78,4005.07,4094.73,3926.17,4433.92,3964.59,4014.69,4331.89,0
4,06-2022,31904710,26-03-1989,1,4.48,8.43,1,1,1,28-06-2008,...,4421.30,4666.98,5053.99,4816.87,4314.71,4711.88,5014.49,4152.09,5288.72,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
309995,03-2022,31104928,13-09-1989,1,1.92,0.63,0,1,1,22-02-2010,...,4545.08,4398.42,4115.42,4334.34,4113.10,4423.33,4726.98,4200.09,4099.52,0
309996,10-2022,38699158,09-10-1973,1,19.89,3.03,0,1,2,30-04-2007,...,4316.77,4325.59,4299.23,3834.01,3677.22,3835.20,4658.65,3992.09,4061.19,0
309997,05-2022,37435274,12-09-1986,3,3.92,3.90,0,2,1,23-08-2015,...,4640.76,5325.48,4832.33,5319.56,5117.83,4823.07,5510.92,5145.15,4537.41,0
309998,07-2022,36145194,11-07-1972,1,18.38,14.47,0,1,1,28-09-2004,...,4469.91,4319.86,4890.04,4619.89,5206.99,4425.69,4695.32,4632.36,4729.46,0
309999,11-2022,37156247,08-04-1990,1,8.04,0.60,0,1,1,19-01-2011,...,3645.49,3864.10,4222.49,3535.97,3598.82,3874.99,3738.57,3569.16,3713.22,0

## clients_age

In [12]:
# change the type of Birth_date to datetime
df['Birth_date'] = pd.to_datetime(df['Birth_date'])

/var/folders/rh/w6cl6rd95vj2g4s03scz_4fc0000gn/T/ipykernel_22683/2259826502.py:2: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Birth_date'] = pd.to_datetime(df['Birth_date'])

In [24]:
# add a column clients_age with the age of the client by substracting the birth_date from the current date
current_date = pd.to_datetime('2024-04-03')
df['clients_age'] = (current_date - df['Birth_date']).astype('<m8[Y]').astype(int)

In [27]:
# delete the column Birth_date
df.drop(columns=['Birth_date'], inplace=True)

Podejście do nowych zmiennych

1. tworzymy 12 nowych zmiennych dla kadej Hx, równocześnie usuwając
2. Liczymy dla kadej ponisze wartości:

(H0 - H3) / H0
(H0 - H6) / H0
(H0 - H12) / H0

In [ ]:
# function to calculate values

## DTI - Debt to income